       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBOL-TEMPLATE.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
           DISPLAY "This is the template".
           STOP RUN.
